-- заполнение таблицы	Countries		(Страны)							
insert into Countries
	(Country)
values
	(N'Аргентина'),				-- 1
	(N'Беларусь'),				-- 2
	(N'Испания'),				-- 3
	(N'Китай'),					-- 4
	(N'Корея'),					-- 5
	(N'Латвия'),				-- 6
	(N'Украина'),				-- 7
	(N'Россия'),				-- 8
	(N'СССР'),					-- 9
	(N'США');					-- 10


-- заполнение таблицы	Genres			(Жанры)			
insert into Genres
	(Genre)
values
	(N'Ужасы'),					-- 1
	(N'Комедия'), 				-- 2
	(N'Криминал'), 				-- 3
	(N'Вестерн'), 				-- 4
	(N'Драма'), 				-- 5
	(N'Приключение'), 			-- 6
	(N'Романтика'), 			-- 7
	(N'Боевик'), 				-- 8
	(N'Исторический'), 			-- 9
	(N'Киноповесть');			-- 10


-- заполнение таблицы	Persons			(Персоны)			
insert into Persons
	(LastName, FirstName, Patronymic, DateOfBirth)
values
	(N'Астафьева',		N'Дарья',		N'Алексеевна',		'1990/12/12'),			-- 1
	(N'Дмитриева',		N'София',		N'Кирилловна',		'1990/03/11'),			-- 2
	(N'Григорьева',		N'Вера',		N'Владиславовна',	'1994/08/12'),			-- 3
	(N'Литвинова',		N'Ольга',		N'Ярославовна',		'1994/07/14'),			-- 4
	(N'Козырев',		N'Юрий',		N'Семёнович',		'1994/02/09'),			-- 5
	(N'Власов',			N'Михаил',		N'Александрович',	'1994/08/14'),			-- 6
	(N'Григорьев',		N'Игорь',		N'Андреевич',		'1994/03/07'),			-- 7
	(N'Колесов',		N'Иван',		N'Александрович',	'1990/12/12'),			-- 8
	(N'Черных',			N'Алина',		N'Ильинична',		'1990/05/12'),			-- 9
	(N'Фадеева',		N'София',		N'Богдановна',		'1989/05/17'),			-- 10
	(N'Калинина',		N'Елизавета',	N'Ивановна',		'1989/05/12'),			-- 11
	(N'Маркова',		N'Амелия',		N'Ильинична',		'1989/05/13'),			-- 12
	(N'Константинова',	N'Мария',		N'Матвеевна',		'1989/05/17'),			-- 13
	(N'Медведева',		N'Вероника',	N'Артемьевна',		'1989/05/12'),			-- 14
	(N'Попов',			N'Михаил',		N'Михайлович',		'1999/12/12'),			-- 15
	(N'Селезнев',		N'Михаил',		N'Дмитриевич',		'1999/03/12'),			-- 16
	(N'Поляков',		N'Дмитрий',		N'Николаевич',		'1999/03/12'),			-- 17
	(N'Карпова',		N'Вера',		N'Данииловна',		'1999/07/16'),			-- 18
	(N'Иванов',			N'Михаил',		N'Александрович',	'1999/03/11'),			-- 19
	(N'Романов',		N'Кирилл',		N'Даниилович',		'1999/06/18'),			-- 20
	(N'Кузнецова',		N'Алиса',		N'Тимофеевна',		'1999/03/04'),			-- 21
	(N'Лаврентьев',		N'Даниил',		N'Максимович',		'1999/03/09'),			-- 22
	(N'Исааков',		N'Сергей',		N'Кириллович',		'1999/03/19'),			-- 23
	(N'Булгакова',		N'Алиса',		N'Алексеевна',		'1990/12/11'),			-- 24
	(N'Измайлов',		N'Елисей',		N'Александрович',	'1990/12/16'),			-- 25
	(N'Алешин',			N'Николай',		N'Андреевич',		'1990/12/17'),			-- 26
	(N'Леонов',			N'Евгений',		N'Павлович',		'1926/09/02'),			-- 27
	(N'Вицин',			N'Георгий',		N'Михайлович ',		'1917/04/18'),			-- 28
	(N'Крамаров',		N'Савелий',		N'Викторович',		'1934/10/13'),			-- 29
	(N'Муратов',		N'Раднэр',		N'Зинятович',		'1928/10/21'),			-- 30
	(N'Фатеева',		N'Наталья',		N'Николаевна',		'1934/12/23'),			-- 31
	(N'Никулин',		N'Юрий',		N'Владимирович',	'1921/12/18'),			-- 32
	(N'Папанов',		N'Анатолий',	N'Дмитриевич',		'1922/12/31'),			-- 33
	(N'Миронов',		N'Андрей',		N'Александрович',	'1941/03/07'),			-- 34
	(N'Гребешкова',		N'Нина',		N'Павловна',		'1930/11/29'),			-- 35
	(N'Быков',			N'Ролан',		N'Антонович',		'1929/11/12'),			-- 36
	(N'Табаков',		N'Олег',		N'Павлович',		'1935/08/17'),			-- 37
	(N'Гайдай',			N'Леонид',		N'Иович',			'1935/08/17');			-- 38


-- заполнение таблицы	Producers		(Продюсеры)			
insert into Producers
	(IdPerson)
values	
	(1),			-- 1
	(2),			-- 2
	(14),			-- 3
	(4),			-- 4
	(5),			-- 5
	(6),			-- 6
	(7),			-- 7
	(18),			-- 8
	(9),			-- 9
	(10);			-- 10	


-- заполнение таблицы	Actors			(Актёры)			
insert into Actors
	(IdPerson)
values
	(11),				-- 1
	(12),				-- 2
	(13),				-- 3
	(14),				-- 4
	(15),				-- 5
	(16),				-- 6
	(17),				-- 7
	(18),				-- 8
	(19),				-- 9
	(20),				-- 10
	(21),				-- 11
	(22),				-- 12
	(23),				-- 13
	(24),				-- 14
	(25),				-- 15
	(26),				-- 16
	(27),				-- 17
	(28),				-- 18
	(29),				-- 19
	(30),				-- 20
	(31),				-- 21
	(32),				-- 22
	(33),				-- 23
	(34),				-- 24
	(35),				-- 25
	(36),				-- 26
	(37),				-- 27
	(38);				-- 28


-- заполнение таблицы	Films			(Фильмы)			
insert into Films
	(Title, IdProducer, ReleaseDate, Budget, IdGenre, IdCountry)
values
	(N'12 стульев',				10,		'1971/05/11',	1980000,		2,		9),				-- 1
	(N'А зори здесь тихие',		 9,		'1972/09/18',	2080000,		5,		9),				-- 2
	(N'Александр Невский',		 5,		'1938/01/16',	3080000,		9,		9),				-- 3
	(N'Алые паруса',			 4,		'1961/10/02',	4080000,		5,		9),				-- 4
	(N'Доктор Лиза',			 1,		'2020/01/06',	1080000,		2,		8),				-- 5
	(N'Конференция',			 8,		'2019/03/12',	8450000,		1,		7),				-- 6
	(N'Спутник',				 7,		'2018/06/03',	1450000,		5,		8),				-- 7
	(N'Керосин',				 8,		'2019/03/12',	5450000,		2,		7),				-- 8
	(N'Марафон желаний',		 3,		'2016/07/18',	6450000,		2,		7),				-- 9
	(N'Один вдох',				 6,		'2015/09/13',	4450000,		1,		6),				-- 10
	(N'Смерть нам к лицу',		 6,		'2019/08/14',	7480000,		1,		6),				-- 11
	(N'Хэппи-энд',				 3,		'2018/03/18',	8480000,		2,		7),				-- 12
	(N'Огонь',					 4,		'2020/11/06',	9480000,		2,		7);  			-- 13


-- заполнение таблицы	ActorsOfFilm	(Актёры фильмов)			
insert into ActorsOfFilm
	(IdActor, IdFilm)
values
	(25,	1),					-- 1
	(26,	1),					-- 2
	(28,	1),					-- 3
	(23,	1),					-- 4
	(27,	1),					-- 5
	(24,	1),					-- 6
	(20,	1),					-- 7
	(21,	1),					-- 8
	(19,	2),					-- 9
	(20,	2),					-- 10
	(21,	2),					-- 11
	(22,	2),					-- 12
	(23,	3),					-- 13
	(24,	3),					-- 14
	(25,	3),					-- 15
	(26,	3),					-- 16
	(27,	3),					-- 17
	(25,	4),					-- 18
	(26,	4),					-- 19
	(27,	4),					-- 20
	(28,	4),					-- 21
	(1,		5),					-- 22
	(2,		5),					-- 23
	(3,		5),					-- 24
	(4,		5),					-- 25
	(5,		5),					-- 26
	(6,		5),					-- 27
	(7,		5),					-- 28
	(8,		5),					-- 29
	(4,		6),					-- 30
	(5,		6),					-- 31
	(6,		6),					-- 32
	(7,		6),					-- 33
	(8,		6),					-- 34
	(9,		6),					-- 35
	(6,		7),					-- 36
	(7,		7),					-- 37
	(8,		7),					-- 38
	(9,		7),					-- 39
	(10,	7),					-- 40
	(11,	7),					-- 41
	(8,		8),					-- 42
	(9,		8),					-- 43
	(10,	8),					-- 44
	(11,	8),					-- 45
	(12,	8),					-- 46
	(9,		9),					-- 47
	(10,	9),					-- 48
	(11,	9),					-- 49
	(12,	9),					-- 50
	(13,	9),					-- 51
	(11,	10),				-- 52
	(12,	10),				-- 53
	(13,	10),				-- 54
	(14,	10),				-- 55
	(15,	10),				-- 56
	(13,	11),				-- 57
	(14,	11),				-- 58
	(15,	11),				-- 59
	(16,	11),				-- 60
	(13,	12),				-- 61
	(14,	12),				-- 62
	(15,	12),				-- 63
	(16,	12),				-- 64
	(17,	12),				-- 65
	(13,	13),				-- 66
	(14,	13),				-- 67
	(15,	13),				-- 68
	(16,	13),				-- 69
	(17,	13);				-- 70
