-- Заполнение таблиц базы данных Polyclinic

-- таблица персональных данных
insert Persons
    (Surname, [Name], Patronymic)
values
    (N'Юрковский',   N'Марк',      N'Максимилианович'), /*  1 */
	(N'Якубовская',  N'Диана',     N'Павловна'),		/*  2 */
    (N'Шапиро',      N'Федор',     N'Федорович'),     	/*  3 */
	(N'Вожжаев',     N'Сергей',    N'Денисович'),     	/*  4 */
    (N'Хроменко',    N'Игорь',     N'Владимирович'),  	/*  5 */
	(N'Пелых',       N'Марина',    N'Ульяновна'),     	/*  6 */
	(N'Лапотникова', N'Тамара',    N'Оскаровна'),     	/*  7 */
	(N'Огородников', N'Сергей',    N'Иванович'),      	/*  8 */
    (N'Яйло',        N'Екатерина', N'Николаевна'),    	/*  9 */
	(N'Лосева',      N'Инна',      N'Степановна'),    	/* 10 */
    (N'Михайлович',  N'Анна',      N'Валентиновна'),  	/* 11 */
	(N'Тарапата',    N'Михаил',    N'Исаакович'),     	/* 12 */
	(N'Трубихин',    N'Эдуард',    N'Михайлович'),    	/* 13 */
	(N'Чмыхало',     N'Олег',      N'Тарасович'),     	/* 14 */
	(N'Князьков',    N'Степан',    N'Сидорович'),     	/* 15 */
	(N'Потемкина',   N'Наталья',   N'Павловна'),      	/* 16 */
    (N'Гритченко',   N'Степан',    N'Романович'),     	/* 17 */
	(N'Селиванов',   N'Александр', N'Михайлович'),    	/* 18 */
	(N'Царькова',    N'Лариса',    N'Ильинична'),     	/* 19 */
	(N'Яструб',      N'Владимир',  N'Данилович'),     	/* 20 */
    (N'Мелашенко',   N'Александр', N'Алексеевич'),    	/* 21 */
	(N'Пономаренко', N'Владислов', N'Дмитриевич'),    	/* 22 */ 
	(N'Хавалджи',    N'Любовь',    N'Амировна'),      	/* 23 */
	(N'Пархоменко',  N'Ирина',     N'Владимировна'),  	/* 24 */
    (N'Демидова',    N'Алина',     N'Александровна'), 	/* 25 */
	(N'Лысенко',     N'Елена',     N'Егоровна'),      	/* 26 */
	(N'Федосенко',   N'Оксана',    N'Владимировна'),  	/* 27 */
	(N'Богатырева',  N'Екатерина', N'Алексеевна'),		/* 28 */
	(N'Иванова',     N'Валентина', N'Степановна'),		/* 29 */
	(N'Ильюшин',     N'Сергей',    N'Юрьевич');		    /* 30 */
go

-- данные справочника врачебных специальностей
insert Specialities
    (Speciality)
values
    (N'терапевт'),      /*  1 */    
	(N'стоматолог'),  	/*  2 */
	(N'окулист'),     	/*  3 */
	(N'кардиолог'),   	/*  4 */
	(N'пульманолог'), 	/*  5 */
	(N'хирург'),      	/*  6 */
	(N'акушер'),      	/*  7 */
	(N'отоларинголог'), /*  8 */     
	(N'инфекционист'),  /*  9 */    
	(N'физиотерпевт'),  /* 10 */    
	(N'онколог'),      	/* 11 */
	(N'венеролог'),     /* 12 */ 
	(N'уролог');      	/* 13 */
go


-- данные таблицы докторов
insert Doctors
    (IdPerson, IdSpeciality, Price, [Percent])
values
    ( 1, 1,  110, 5.0),  /*  1 */
	( 2, 2,  600, 3.0),	 /*  2 */
    ( 3, 1,  160, 3.5),	 /*  3 */
	( 4, 1,  250, 3.2),	 /*  4 */
    ( 5, 3,  300, 4.5),	 /*  5 */
	( 6, 2,  600, 4.5),	 /*  6 */
	( 7, 4,  300, 4.0),	 /*  7 */
	( 8, 5,  250, 3.5),	 /*  8 */
    ( 9, 6,  800, 5.1),	 /*  9 */
	(10, 6, 1300, 4.5),	 /* 10 */
    (11, 2,  350, 3.1),	 /* 11 */
	(12, 1,  120, 6.2);	 /* 12 */
go

-- данные таблицы пациентов
insert Patients  
    (IdPerson, BornDate, [Address])
values                                                    
    (13, '02-12-2001', N'ул. Садовая, д. 123, кв. 12'),       /*  1 */
	(14, '07-09-1991', N'ул. Зайцева, д. 2'),				  /*  2 */
	(15, '03-18-1963', N'пр. Титова, д. 11, кв. 91'),		  /*  3 */
	(16, '04-21-1957', N'ул. Содовая, д. 9'),				  /*  4 */
    (17, '02-12-2001', N'ул. Челюскинцев, д. 112, кв. 211'),  /*  5 */
	(18, '06-01-1935', N'пр. Титова, д. 9, кв. 21'),		  /*  6 */
	(19, '07-06-1992', N'пл. Конституции, д. 3, кв. 75'),	  /*  7 */
	(20, '07-09-1991', N'пр. Мира, д. 3, кв. 64'),			  /*  8 */
    (21, '12-23-1947', N'ул. Содовая, д. 9, кв. 6'),		  /*  9 */
	(22, '07-09-1991', N'ул. Садовая, д. 10'),				  /* 10 */
	(23, '09-29-1956', N'ул. Судовая, д. 1, кв. 91'),		  /* 11 */
	(24, '04-13-1963', N'пр. Титова, д. 31, кв. 42'),		  /* 12 */
    (25, '04-21-1957', N'ул. Челюскинцев, д. 3'),			  /* 13 */
	(26, '02-12-2001', N'пр. Содовая, д. 13'),				  /* 14 */
	(27, '11-04-2001', N'пл. Конституции, д. 1, кв. 50'),	  /* 15 */
	(28, '10-09-2001', N'ул. Щорса, д. 23, кв. 17'),		  /* 16 */
	(29, '12-21-1998', N'ул. Овнатаняна, д. 4, кв. 98'),      /* 17 */
	(30, '02-27-1997', N'ул. Чкалова, д. 11');		          /* 18 */
go


-- данные таблицы врачебных приемов 
insert Appointments
    (AppointmentDate, IdPatient, IdDoctor)
values
    ('10-21-21',  1,  1),   /*  1 */
    ('10-21-21',  2,  1),	/*  2 */
    ('10-21-21',  3,  2),	/*  3 */
    ('10-22-21',  4,  3),	/*  4 */
    ('10-22-21',  4,  5),	/*  5 */
    ('10-22-21',  3,  5),	/*  6 */
    ('10-22-21',  2,  6),	/*  7 */
    ('10-23-21',  5,  2),	/*  8 */
    ('10-23-21',  6,  5),	/*  9 */
    ('10-24-21',  9,  6),	/* 10 */
    ('10-24-21',  7,  6),	/* 11 */
    ('10-28-21',  3,  7),	/* 12 */
    ('10-28-21',  2,  8),	/* 13 */
    ('10-28-21',  4,  9),	/* 14 */
    ('11-02-21',  6,  9),	/* 15 */
    ('11-02-21',  7,  1),	/* 16 */
    ('11-02-21',  8,  2),	/* 17 */
    ('11-02-21', 10,  2),	/* 18 */
    ('11-03-21',  5,  5),	/* 19 */
    ('11-03-21',  9,  7),	/* 20 */
    ('11-03-21',  6,  7);	/* 21 */
go