delete from StaffingTable;		-- очистка таблицы StaffingTable			(Штатное расписание)	 
delete from DistributionUnits;	-- очистка таблицы DistributionUnits		(Распределение штатных единиц)	 
delete from Devisions;			-- очистка таблицы Devisions				(Подразделения)	 
delete from Units;				-- очистка таблицы Units					(Штатные единицы)	 
delete from WorkLevels;			-- очистка таблицы WorkLevels				(Рабочие разряды)
delete from UnitTypes;			-- очистка таблицы UnitTypes				(Тип штатной единицы)	 
delete from Persons;			-- очистка таблицы Persons					(Персоны)	 
delete from DevisionTypes;		-- очистка таблицы DevisionTypes			(Типы подразделения)				
go


insert into DevisionTypes		-- заполнение таблицы DevisionTypes			(Типы подразделения)
	(Title)
values
	(N'Цех'),				-- 1
	(N'Филиал'),			-- 2
	(N'Отдел'),				-- 3
	(N'Бригада'),			-- 4
	(N'Сектор'),			-- 5
	(N'Архив');				-- 6


insert into Persons				-- заполнение таблицы Persons				(Персоны)	 
	(LastName, FirstName, Patronymic)
values
	(N'Астафьева',		N'Дарья',		N'Алексеевна'		),			-- 1
	(N'Дмитриева',		N'София',		N'Кирилловна'		),			-- 2
	(N'Григорьева',		N'Вера',		N'Владиславовна'	),			-- 3
	(N'Литвинова',		N'Ольга',		N'Ярославовна'		),			-- 4
	(N'Козырев',		N'Юрий',		N'Семёнович'		),			-- 5
	(N'Власов',			N'Михаил',		N'Александрович'	),			-- 6
	(N'Григорьев',		N'Игорь',		N'Андреевич'		),			-- 7
	(N'Колесов',		N'Иван',		N'Александрович'	),			-- 8
	(N'Черных',			N'Алина',		N'Ильинична'		),			-- 9
	(N'Фадеева',		N'София',		N'Богдановна'		),			-- 10
	(N'Калинина',		N'Елизавета',	N'Ивановна'	 		),			-- 11
	(N'Маркова',		N'Амелия',		N'Ильинична'		),			-- 12
	(N'Константинова',	N'Мария',		N'Матвеевна'		),			-- 13
	(N'Медведева',		N'Вероника',	N'Артемьевна'		),			-- 14
	(N'Попов',			N'Михаил',		N'Михайлович'		),			-- 15
	(N'Селезнев',		N'Михаил',		N'Дмитриевич'		),			-- 16
	(N'Поляков',		N'Дмитрий',		N'Николаевич'		),			-- 17
	(N'Карпова',		N'Вера',		N'Данииловна'		),			-- 18
	(N'Иванов',			N'Михаил',		N'Александрович'	),			-- 19
	(N'Романов',		N'Кирилл',		N'Даниилович'		),			-- 20
	(N'Кузнецова',		N'Алиса',		N'Тимофеевна'		),			-- 21
	(N'Лаврентьев',		N'Даниил',		N'Максимович'		),			-- 22
	(N'Исааков',		N'Сергей',		N'Кириллович'		),			-- 23
	(N'Булгакова',		N'Алиса',		N'Алексеевна'		),			-- 24
	(N'Измайлов',		N'Елисей',		N'Александрович'	),			-- 25
	(N'Алешин',			N'Николай',		N'Андреевич'		),			-- 26
	(N'Леонов',			N'Евгений',		N'Павлович'			),			-- 27
	(N'Вицин',			N'Георгий',		N'Михайлович '		),			-- 28
	(N'Крамаров',		N'Савелий',		N'Викторович'		),			-- 29
	(N'Муратов',		N'Раднэр',		N'Зинятович'		),			-- 30
	(N'Фатеева',		N'Наталья',		N'Николаевна'		),			-- 31
	(N'Никулин',		N'Юрий',		N'Владимирович'		),			-- 32
	(N'Папанов',		N'Анатолий',	N'Дмитриевич'		),			-- 33
	(N'Миронов',		N'Андрей',		N'Александрович'	),			-- 34
	(N'Гребешкова',		N'Нина',		N'Павловна'			),			-- 35
	(N'Быков',			N'Ролан',		N'Антонович'		),			-- 36
	(N'Табаков',		N'Олег',		N'Павлович'			),			-- 37
	(N'Гайдай',			N'Леонид',		N'Иович'			),			-- 38
	(N'Коновалов',		N'Бронислав',	N'Васильевич'		),			-- 39
	(N'Авдеев',			N'Денис',		N'Яковлевич'		),			-- 40
	(N'Мышкин',			N'Виктор',		N'Григорьевич'		),			-- 41
	(N'Якушев',			N'Оскар',		N'Яковлевич'		),			-- 42
	(N'Власов',			N'Даниил',		N'Валерьевич'		),			-- 43
	(N'Анисимов',		N'Велорий',		N'Федорович'		),			-- 44
	(N'Панов',			N'Климент',		N'Филиппович'		),			-- 45
	(N'Шаров',			N'Бенедикт',	N'Богданович'		),			-- 46
	(N'Мышкин',			N'Эрик',		N'Агафонович'		),			-- 47
	(N'Морозов',		N'Ян',			N'Александрович'	),			-- 48
	(N'Лапин',			N'Исаак',		N'Германнович'		),			-- 49
	(N'Филатов',		N'Владлен',		N'Ростиславович'	),			-- 50
	(N'Муравьёв',		N'Платон',		N'Денисович'		),			-- 51
	(N'Брагин',			N'Денис',		N'Евсеевич'			),			-- 52
	(N'Рожков',			N'Осип',		N'Парфеньевич'		),			-- 53
	(N'Лукин',			N'Петр',		N'Тимурович'		),			-- 54
	(N'Новиков',		N'Владлен',		N'Олегович'			),			-- 55
	(N'Князев',			N'Всеволод',	N'Юлианович'		),			-- 56
	(N'Капустин',		N'Исаак',		N'Даниилович'		),			-- 57
	(N'Молчанов',		N'Аристарх',	N'Авксентьевич'		),			-- 58
	(N'Буров',			N'Степан',		N'Мартынович'		),			-- 59
	(N'Рогов',			N'Анатолий',	N'Игнатьевич'		),			-- 60
	(N'Соколов',		N'Владислав',	N'Семенович'		),			-- 61
	(N'Жданов',			N'Давид',		N'Петрович'			),			-- 62
	(N'Ильин',			N'Азарий',		N'Гордеевич'		),			-- 63
	(N'Архипов',		N'Авраам',		N'Анатольевич'		),			-- 64
	(N'Орлов',			N'Святослав',	N'Онисимович'		),			-- 65
	(N'Козлов',			N'Вячеслав',	N'Дамирович'		),			-- 66
	(N'Матвеев',		N'Пантелей',	N'Данилович'		),			-- 67
	(N'Ильин',			N'Соломон',		N'Иосифович'		),			-- 68
	(N'Ефимов',			N'Мечеслав',	N'Владимирович'		),			-- 69
	(N'Пестов',			N'Лавр',		N'Павлович'			),			-- 70
	(N'Зыков',			N'Анатолий',	N'Германнович'		),			-- 71
	(N'Федотов',		N'Нисон',		N'Мэлорович'		),			-- 72
	(N'Воронов',		N'Наум',		N'Серапионович'		),			-- 73
	(N'Романов',		N'Владимир',	N'Владленович'		),			-- 74
	(N'Игнатьев',		N'Эльдар',		N'Леонидович'		),			-- 75
	(N'Федосеев',		N'Захар',		N'Наумович'			),			-- 76
	(N'Самсонов',		N'Моисей',		N'Вадимович'		),			-- 77
	(N'Пахомов',		N'Вальтер',		N'Агафонович'		),			-- 78
	(N'Гордеев',		N'Николай',		N'Рубенович'		),			-- 79
	(N'Ковалёв',		N'Натан',		N'Георгьевич'		),			-- 80
	(N'Сидоров',		N'Никифор',		N'Тарасович'		),			-- 81
	(N'Сидоров',		N'Демьян',		N'Юлианович'		),			-- 82
	(N'Терентьев',		N'Ермолай',		N'Кириллович'		),			-- 83
	(N'Симонов',		N'Аскольд',		N'Валентинович'		),			-- 84
	(N'Голубев',		N'Борис',		N'Лаврентьевич'		),			-- 85
	(N'Соловьёв',		N'Корнелий',	N'Ярославович'		),			-- 86
	(N'Цветков',		N'Овидий',		N'Пётрович'			),			-- 87
	(N'Кузьмин',		N'Глеб',		N'Германович'		),			-- 88
	(N'Фёдоров',		N'Геннадий',	N'Аркадьевич'		),			-- 89
	(N'Беляков',		N'Аверьян',		N'Юрьевич'			),			-- 90
	(N'Дорофеев',		N'Осип',		N'Валентинович'		),			-- 91
	(N'Никифоров',		N'Бронислав',	N'Данилович'		),			-- 92
	(N'Беспалов',		N'Ермак',		N'Миронович'		),			-- 93
	(N'Николаев',		N'Агафон',		N'Георгиевич'		),			-- 94
	(N'Громов',			N'Лаврентий',	N'Васильевич'		),			-- 95
	(N'Князев',			N'Родион',		N'Иринеевич'		),			-- 96
	(N'Маслов',			N'Демьян',		N'Иосифович'		),			-- 97
	(N'Максимов',		N'Артур',		N'Павлович'			),			-- 98
	(N'Агафонов',		N'Харитон',		N'Платонович'		),			-- 99
	(N'Симонов',		N'Терентий',	N'Александрович'	),			-- 100
	(N'Корнилов',		N'Валерий',		N'Михайлович'		),			-- 101
	(N'Аспидов',		N'Самсон',		N'Станиславович'	),			-- 102
	(N'Лощилов',		N'Аким',		N'Максимович'		),			-- 103
	(N'Ревягин',		N'Игорь',		N'Александрович'	),			-- 104
	(N'Поляков',		N'Семен',		N'Артёмович'		),			-- 105
	(N'Шорин',			N'Павел',		N'Владимирович'		),			-- 106
	(N'Лель',			N'Степан',		N'Артёмович'		),			-- 107
	(N'Можаев',			N'Владлен',		N'Александрович'	),			-- 108
	(N'Якунькин',		N'Тигран',		N'Фёдорович'		),			-- 109
	(N'Сталин',			N'Борислав',	N'Брониславович'	),			-- 110
	(N'Караулов',		N'Клавдий',		N'Александрович'	),			-- 111
	(N'Остроумов',		N'Мефодий',		N'Петрович'			),			-- 112
	(N'Якунькин',		N'Билал',		N'Александрович'	),			-- 113
	(N'Назаров',		N'Елизар',		N'Данилович'		),			-- 114
	(N'Бок',			N'Стефан',		N'Сергеевич'		),			-- 115
	(N'Мажов',			N'Рафаэль',		N'Ярославович'		),			-- 116
	(N'Яблоновский',	N'Радислав',	N'Борисович'		),			-- 117
	(N'Аввакумов',		N'Тимур',		N'Львович'			),			-- 118
	(N'Щередин',		N'Казимир',		N'Ярославович'		),			-- 119
	(N'Травин',			N'Аристарх',	N'Ярославович'		),			-- 120
	(N'Бялик',			N'Роберт',		N'Романович'		),			-- 121
	(N'Авдонин',		N'Ибрагим',		N'Васильевич'		),			-- 122
	(N'Туров',			N'Всеслав',		N'Вадимович'		),			-- 123
	(N'Юдачёв',			N'Добрыня',		N'Леонидович'		),			-- 124
	(N'Образцов',		N'Евсей',		N'Григорьевич'		),			-- 125
	(N'Юнге',			N'Агап',		N'Андреевич'		),			-- 126
	(N'Золин',			N'Кирилл',		N'Артёмович'		),			-- 127
	(N'Бабкин',			N'Вацлав',		N'Богданович'		),			-- 128
	(N'Владимиров',		N'Лука',		N'Брониславович'	),			-- 129
	(N'Балинский',		N'Эмин',		N'Анатолиевич'		),			-- 130
	(N'Арсеньев',		N'Платон',		N'Станиславович'	),			-- 131
	(N'Травкин',		N'Пахом',		N'Андреевич'		),			-- 132
	(N'Решетов',		N'Кир',			N'Максимович'		),			-- 133
	(N'Чичерин',		N'Прокофий',	N'Юхимович'			),			-- 134
	(N'Масмехов',		N'Эрнест',		N'Богданович'		),			-- 135
	(N'Хоботилов',		N'Артемий',		N'Анатолиевич'		),			-- 136
	(N'Зухин',			N'Юлиан',		N'Григорьевич'		),			-- 137
	(N'Шишканов',		N'Михаил',		N'Леонидович'		),			-- 138
	(N'Низенький',		N'Вениамин',	N'Данилович'		),			-- 139
	(N'Киреев',			N'Валентин',	N'Александрович'	),			-- 140
	(N'Чиркаш',			N'Михей',		N'Фёдорович'		),			-- 141
	(N'Кольцов',		N'Фадей',		N'Валериевич'		),			-- 142
	(N'Свечников',		N'Данила',		N'Данилович'		),			-- 143
	(N'Юсупов',			N'Гавриил',		N'Валериевич'		),			-- 144
	(N'Журов',			N'Данияр',		N'Петрович'			),			-- 145
	(N'Карякин',		N'Эммануил',	N'Вадимович'		),			-- 146
	(N'Беляев',			N'Капитон',		N'Романович'		),			-- 147
	(N'Колганов',		N'Савелий',		N'Дмитриевич'		),			-- 148
	(N'Голубов',		N'Ян',			N'Леонидович'		),			-- 149
	(N'Павленко',		N'Яков',		N'Борисович'		),			-- 150
	(N'Питосин',		N'Даниил',		N'Станиславович'	),			-- 151
	(N'Немцев',			N'Игнатий',		N'Владимирович'		),			-- 152
	(N'Дубинкин',		N'Гордей',		N'Александрович'	);			-- 153


insert into UnitTypes			-- заполнение таблицы UnitTypes				(Тип штатной единицы)	 
	(Title)
values
	(N'Директор'),				-- 1
	(N'Начальник'),				-- 2
	(N'Инспектор'),				-- 3
	(N'Бухгалтер'),				-- 4
	(N'Консультант'),			-- 5
	(N'Кассир'),				-- 6
	(N'Инженер'),				-- 7
	(N'Менеджер'),				-- 8
	(N'Экспедитор'),			-- 9
	(N'Водитель'),				-- 10
	(N'Инженер-электрик');		-- 11


insert into WorkLevels			-- заполнение таблицы WorkLevels			(Рабочие разряды)
	(Title)
values
	(N'2 разряд'),					-- 1
	(N'3 разряд'),					-- 2
	(N'4 разряд'),					-- 3
	(N'5 разряд'),					-- 4
	(N'6 разряд'),					-- 5
	(N'7 разряд'),					-- 6
	(N'8 разряд'),					-- 7
	(N'1 категория'),				-- 8
	(N'2 категория'),				-- 9
	(N'3 категория'),				-- 10
	(N'Высшая категория');			-- 11


insert into Units				-- заполнение таблицы Units					(Штатные единицы)	 
	(IdUnitType, IdWorkLevel, Salary, InterestAllowancetTwo, LeaveDays)
values
	-- директор		
	(1,		10,		100000,		40,		50),		-- 1
	(1,		 9,		 80000,		35,		40),		-- 2
	-- начальник	
	(2,		 6,		 90000,		20,		40),		-- 3
	(2,		 5,		 80000,		25,		35),		-- 4
	-- менеджер		
	(8,		 4,		 50000,		20,		40),		-- 5
	(8,		 3,		 40000,		20,		30),		-- 6
	-- бухгалтер	
	(4,		 4,		 50000,		10,		45),		-- 7
	(4,		 3,		 40000,		10,		30),		-- 8
	-- инженер
	(7,		 2,		 60000,		20,		50),		-- 9
	(7,		 3,		 70000,		20,		40),		-- 10
	-- консультант
	(5,		 1,		 35000,		10,		30),		-- 11
	-- инженер-электрик		
	(11,	 4,		 40000,		35,		30);		-- 12



insert into Devisions			-- заполнение таблицы Devisions				(Подразделения)	 
	(Title, IdDevisionType, InterestAllowancetOne)
values
	(N'Администрация',				2,		12),	-- 1
	(N'Кадровый',					3,		10),	-- 2
	(N'Бухгалтерия',				2,		15),	-- 3
	(N'Производственный',			1,		15),	-- 4
	(N'Отдел сбыта',				3,		20);	-- 5


insert into DistributionUnits	-- заполнение таблицы DistributionUnits		(Распределение штатных единиц) (всего 153 человека)	
	(IdDevision, IdUnit, Amount)
values
	-- администрация	(22 человек)
	(1,		 1,		 1),		-- 1	(Директор)
	(1,		 3,		 1),		-- 2	(Начальник)
	(1,		 5,		 5),		-- 3	(Менеджер)
	(1,		 6,		10),		-- 4	(Менеджер)
	(1,		 9,		 3),		-- 5	(Инженер)
	(1,		10,		 2),		-- 6	(Инженер)
	-- Кадровый			(14 человек)
	(2,		 2,		 1),		-- 7	(Директор)
	(2,		 5,		 5),		-- 8	(Менеджер)
	(2,		 6,		 5),		-- 9	(Менеджер)
	(2,		 9,		 3),		-- 10	(Инженер)
	-- Бухгалтерия		(31 человек)
	(3,		 4,		  1),		-- 11	(Начальник)
	(3,		 5,		  3),		-- 12	(Менеджер)
	(3,		 6,		  4),		-- 13	(Менеджер)
	(3,		 7,		 10),		-- 14	(Бухгалтер)
	(3,		 8,		 10),		-- 15	(Бухгалтер)
	(3,		 9,		  3),		-- 16	(Инженер)
	-- Производственный	(35 человек)
	(4,		 4,		  1),		-- 17	(Начальник)
	(4,		 5,		  2),		-- 18	(Менеджер)
	(4,		 6,		  2),		-- 19	(Менеджер)
	(4,		 9,		 15),		-- 20	(Инженер)
	(4,		10,		 15),		-- 21	(Инженер)
	-- Отдел сбыта		(51 человек)
	(5,		 2,		  1),		-- 22	(Директор)
	(5,		 5,		 10),		-- 23	(Менеджер)
	(5,		 6,		 10),		-- 24	(Менеджер)
	(5,		11,		 30);		-- 25	(Консультанты)


insert into StaffingTable		-- заполнение таблицы StaffingTable			(Штатное расписание)			
	(IdDevision, IdUnit, IdPerson)
values
	-- администрация	(22 человек)
	(1,		 1,		  1),		-- 1		(Директор)
	(1,		 3,		  2),		-- 2		(Начальник)
	(1,		 5,		  3),		-- 3		(Менеджер)
	(1,		 5,		  4),		-- 4		(Менеджер)
	(1,		 5,		  5),		-- 5		(Менеджер)
	(1,		 5,		  6),		-- 6		(Менеджер)
	(1,		 5,		  7),		-- 7		(Менеджер)
	(1,		 6,		  8),		-- 8		(Менеджер)
	(1,		 6,		  9),		-- 9		(Менеджер)
	(1,		 6,		 10),		-- 10		(Менеджер)
	(1,		 6,		 11),		-- 11		(Менеджер)
	(1,		 6,		 12),		-- 12		(Менеджер)
	(1,		 6,		 13),		-- 13		(Менеджер)
	(1,		 6,		 14),		-- 14		(Менеджер)
	(1,		 6,		 15),		-- 15		(Менеджер)
	(1,		 6,		 16),		-- 16		(Менеджер)
	(1,		 6,		 17),		-- 17		(Менеджер)
	(1,		 9,		 18),		-- 18		(Инженер)
	(1,		 9,		 19),		-- 19		(Инженер)
	(1,		 9,		 20),		-- 20		(Инженер)
	(1,		10,		 21),		-- 21		(Инженер)
	(1,		10,		 22),		-- 22		(Инженер)
	-- Кадровый			(14 человек)
	(2,		 2,		 23),		-- 23		(Директор)
	(2,		 5,		 24),		-- 24		(Менеджер)
	(2,		 5,		 25),		-- 25		(Менеджер)
	(2,		 5,		 26),		-- 26		(Менеджер)
	(2,		 5,		 27),		-- 27		(Менеджер)
	(2,		 5,		 28),		-- 28		(Менеджер)
	(2,		 6,		 29),		-- 29		(Менеджер)
	(2,		 6,		 30),		-- 30		(Менеджер)
	(2,		 6,		 31),		-- 31		(Менеджер)
	(2,		 6,		 32),		-- 32		(Менеджер)
	(2,		 6,		 33),		-- 33		(Менеджер)
	(2,		 9,		 34),		-- 34		(Инженер)
	(2,		 9,		 35),		-- 35		(Инженер)
	(2,		 9,		 36),		-- 36		(Инженер)
	-- Бухгалтерия		(31 человек)
	(3,		 4,		 37),		-- 37		(Начальник)
	(3,		 5,		 38),		-- 38		(Менеджер)
	(3,		 5,		 39),		-- 39		(Менеджер)
	(3,		 5,		 40),		-- 40		(Менеджер)
	(3,		 6,		 41),		-- 41		(Менеджер)
	(3,		 6,		 42),		-- 42		(Менеджер)
	(3,		 6,		 43),		-- 43		(Менеджер)
	(3,		 6,		 44),		-- 44		(Менеджер)
	(3,		 7,		 45),		-- 45		(Бухгалтер)
	(3,		 7,		 46),		-- 46		(Бухгалтер)
	(3,		 7,		 47),		-- 47		(Бухгалтер)
	(3,		 7,		 48),		-- 48		(Бухгалтер)
	(3,		 7,		 49),		-- 49		(Бухгалтер)
	(3,		 7,		 50),		-- 50		(Бухгалтер)
	(3,		 7,		 51),		-- 51		(Бухгалтер)
	(3,		 7,		 52),		-- 52		(Бухгалтер)
	(3,		 7,		 53),		-- 53		(Бухгалтер)
	(3,		 7,		 54),		-- 54		(Бухгалтер)
	(3,		 8,		 55),		-- 55		(Бухгалтер)
	(3,		 8,		 56),		-- 56		(Бухгалтер)
	(3,		 8,		 57),		-- 57		(Бухгалтер)
	(3,		 8,		 58),		-- 58		(Бухгалтер)
	(3,		 8,		 59),		-- 59		(Бухгалтер)
	(3,		 8,		 60),		-- 60		(Бухгалтер)
	(3,		 8,		 61),		-- 61		(Бухгалтер)
	(3,		 8,		 62),		-- 62		(Бухгалтер)
	(3,		 8,		 63),		-- 63		(Бухгалтер)
	(3,		 8,		 64),		-- 64		(Бухгалтер)
	(3,		 9,		 65),		-- 65		(Инженер)
	(3,		 9,		 66),		-- 66		(Инженер)
	(3,		 9,		 67),		-- 67		(Инженер)
	-- Производственный	(35 человек)
	(4,		 4,		 68),		-- 68		(Начальник)
	(4,		 5,		 69),		-- 69		(Менеджер)
	(4,		 5,		 70),		-- 70		(Менеджер)
	(4,		 6,		 71),		-- 71		(Менеджер)
	(4,		 6,		 72),		-- 72		(Менеджер)
	(4,		 9,		 73),		-- 73		(Инженер)
	(4,		 9,		 74),		-- 74		(Инженер)
	(4,		 9,		 75),		-- 75		(Инженер)
	(4,		 9,		 76),		-- 76		(Инженер)
	(4,		 9,		 77),		-- 77		(Инженер)
	(4,		 9,		 78),		-- 78		(Инженер)
	(4,		 9,		 79),		-- 79		(Инженер)
	(4,		 9,		 80),		-- 80		(Инженер)
	(4,		 9,		 81),		-- 81		(Инженер)
	(4,		 9,		 82),		-- 82		(Инженер)
	(4,		 9,		 83),		-- 83		(Инженер)
	(4,		 9,		 84),		-- 84		(Инженер)
	(4,		 9,		 85),		-- 85		(Инженер)
	(4,		 9,		 86),		-- 86		(Инженер)
	(4,		 9,		 87),		-- 87		(Инженер)
	(4,		10,		 88),		-- 88		(Инженер)
	(4,		10,		 89),		-- 89		(Инженер)
	(4,		10,		 90),		-- 90		(Инженер)
	(4,		10,		 91),		-- 91		(Инженер)
	(4,		10,		 92),		-- 92		(Инженер)
	(4,		10,		 93),		-- 93		(Инженер)
	(4,		10,		 94),		-- 94		(Инженер)
	(4,		10,		 95),		-- 95		(Инженер)
	(4,		10,		 96),		-- 96		(Инженер)
	(4,		10,		 97),		-- 97		(Инженер)
	(4,		10,		 98),		-- 98		(Инженер)
	(4,		10,		 99),		-- 99		(Инженер)
	(4,		10,		100),		-- 100		(Инженер)
	(4,		10,		101),		-- 101		(Инженер)
	(4,		10,		102),		-- 102		(Инженер)
	-- Отдел сбыта		(51 человек)
	(5,		 2,		 103),		-- 103		(Директор)
	(5,		 5,		 104),		-- 104		(Менеджер)
	(5,		 5,		 105),		-- 105		(Менеджер)
	(5,		 5,		 106),		-- 106		(Менеджер)
	(5,		 5,		 107),		-- 107		(Менеджер)
	(5,		 5,		 108),		-- 108		(Менеджер)
	(5,		 5,		 109),		-- 109		(Менеджер)
	(5,		 5,		 110),		-- 110		(Менеджер)
	(5,		 5,		 111),		-- 111		(Менеджер)
	(5,		 5,		 112),		-- 112		(Менеджер)
	(5,		 5,		 113),		-- 113		(Менеджер)
	(5,		 6,		 114),		-- 114		(Менеджер)
	(5,		 6,		 115),		-- 115		(Менеджер)
	(5,		 6,		 116),		-- 116		(Менеджер)
	(5,		 6,		 117),		-- 117		(Менеджер)
	(5,		 6,		 118),		-- 118		(Менеджер)
	(5,		 6,		 119),		-- 119		(Менеджер)
	(5,		 6,		 120),		-- 120		(Менеджер)
	(5,		 6,		 121),		-- 121		(Менеджер)
	(5,		 6,		 122),		-- 122		(Менеджер)
	(5,		 6,		 123),		-- 123		(Менеджер)
	(5,		11,		 124),		-- 124		(Консультанты)
	(5,		11,		 125),		-- 125		(Консультанты)
	(5,		11,		 126),		-- 126		(Консультанты)
	(5,		11,		 127),		-- 127		(Консультанты)
	(5,		11,		 128),		-- 128		(Консультанты)
	(5,		11,		 129),		-- 129		(Консультанты)
	(5,		11,		 130),		-- 130		(Консультанты)
	(5,		11,		 131),		-- 131		(Консультанты)
	(5,		11,		 132),		-- 132		(Консультанты)
	(5,		11,		 133),		-- 133		(Консультанты)
	(5,		11,		 134),		-- 134		(Консультанты)
	(5,		11,		 135),		-- 135		(Консультанты)
	(5,		11,		 136),		-- 136		(Консультанты)
	(5,		11,		 137),		-- 137		(Консультанты)
	(5,		11,		 138),		-- 138		(Консультанты)
	(5,		11,		 139),		-- 139		(Консультанты)
	(5,		11,		 140),		-- 140		(Консультанты)
	(5,		11,		 141),		-- 141		(Консультанты)
	(5,		11,		 142),		-- 142		(Консультанты)
	(5,		11,		 143),		-- 143		(Консультанты)
	(5,		11,		 144),		-- 144		(Консультанты)
	(5,		11,		 145),		-- 145		(Консультанты)
	(5,		11,		 146),		-- 146		(Консультанты)
	(5,		11,		 147),		-- 147		(Консультанты)
	(5,		11,		 148),		-- 148		(Консультанты)
	(5,		11,		 149),		-- 149		(Консультанты)
	(5,		11,		 150),		-- 150		(Консультанты)
	(5,		11,		 151),		-- 151		(Консультанты)
	(5,		11,		 152),		-- 152		(Консультанты)
	(5,		11,		 153);		-- 153		(Консультанты)