-- заполнение таблицы Brands (Модели_автомобилей)
insert into 
	Brands(Brand)
values
	('BMW X6'),						-- 1
	('BMW E81'),					-- 2
	('BMW E90'),					-- 3
	('Mercedes-Benz W124AMG'),		-- 4
	('Mercedes-Benz W906'),			-- 5
	('Mercedes-Benz W221'),			-- 6
	('Mercedes-Benz W414'),			-- 7
	('Infiniti FX37'),				-- 8
	('Infiniti G37'),				-- 9
	('Infiniti JX35')				-- 10


-- заполнение таблицы Colors (цвета)
insert into
	Colors(Color)
values
	(N'Синий'),				-- 1
	(N'Красный'),			-- 2
	(N'Чёрный'),			-- 3
	(N'Фиолетовый'),		-- 4
	(N'Голубой'),			-- 5
	(N'Жёлтый'),			-- 6
	(N'Зелёный'),			-- 7
	(N'Серый'),				-- 8
	(N'Бирюзовый'),			-- 9
	(N'Розовый')			-- 10


-- заполнение таблицы Clients (Клиенты)
insert into
	Clients(Surname, [Name], Patronymic, Passport)
values
	(N'Астафьева',		N'Дарья',		N'Алексеевна',		N'ЕС45718'),			-- 1
	(N'Дмитриева',		N'София',		N'Кирилловна',		N'АВ34524'),			-- 2
	(N'Григорьева',		N'Вера',		N'Владиславовна',	N'АТ65423'),			-- 3
	(N'Литвинова',		N'Ольга',		N'Ярославовна',		N'ВО12312'),			-- 4
	(N'Козырев',		N'Юрий',		N'Семёнович',		N'СК67443'),			-- 5
	(N'Власов',			N'Михаил',		N'Александрович',	N'ВА12234'),			-- 6
	(N'Григорьев',		N'Игорь',		N'Андреевич',		N'СО54334'),			-- 7
	(N'Колесов',		N'Иван',		N'Александрович',	N'ВС89532'),			-- 8
	(N'Черных',			N'Алина',		N'Ильинична',		N'СС34267'),			-- 9
	(N'Фадеева',		N'София',		N'Богдановна',		N'АТ23414'),			-- 10
	(N'Калинина',		N'Елизавета',	N'Ивановна',		N'СО98751'),			-- 11
	(N'Маркова',		N'Амелия',		N'Ильинична',		N'ВА32456'),			-- 12
	(N'Константинова',	N'Мария',		N'Матвеевна',		N'ВО98412'),			-- 13
	(N'Медведева',		N'Вероника',	N'Артемьевна',		N'АТ15321'),			-- 14
	(N'Попов',			N'Михаил',		N'Михайлович',		N'СС75198'),			-- 15
	(N'Селезнев',		N'Михаил',		N'Дмитриевич',		N'ЕС98415'),			-- 16
	(N'Поляков',		N'Дмитрий',		N'Николаевич',		N'АВ51591'),			-- 17
	(N'Карпова',		N'Вера',		N'Данииловна',		N'АТ57484'),			-- 18
	(N'Иванов',			N'Михаил',		N'Александрович',	N'ВО32195'),			-- 19
	(N'Романов',		N'Кирилл',		N'Даниилович',		N'СК98412'),			-- 20
	(N'Кузнецова',		N'Алиса',		N'Тимофеевна',		N'ВА78421'),			-- 21
	(N'Лаврентьев',		N'Даниил',		N'Максимович',		N'СО95851'),			-- 22
	(N'Исааков',		N'Сергей',		N'Кириллович',		N'ВС21354'),			-- 23
	(N'Булгакова',		N'Алиса',		N'Алексеевна',		N'СС51871'),			-- 24
	(N'Измайлов',		N'Елисей',		N'Александрович',	N'АТ21574'),			-- 25
	(N'Алешин',			N'Николай',		N'Андреевич',		N'АТ91524')				-- 26

-- заполнение таблицы Cars (Машины)
insert into Cars 
	(IdBrand, IdColor, Plate, YearManuf, InshurancePay, Rental)
values
	(1,	1,	N'АН4841ТС', 2007, 80000, 8000),		-- 1
	(5,	4,	N'НО7985ВТ', 2010, 50000, 3000),		-- 2
	(4,	9,	N'АС2194СН', 2012, 70000, 7000),		-- 3
	(4,	4,	N'СН9155ТС', 2007, 50000, 5000),		-- 4
	(6,	1,	N'АС9549ВТ', 2007, 30000, 9000),		-- 5
	(2,	9,	N'НО2315СН', 2017, 80000, 10000),		-- 6
	(4,	1,	N'АН9517ВТ', 2007, 50000, 2000),		-- 7
	(2,	6,	N'АС3214ТС', 2006, 50000, 4000),		-- 8
	(9,	1,	N'СН5187ВТ', 2007, 90000, 7000),		-- 9
	(6,	2,	N'АС3215ТС', 2007, 70000, 9000)			-- 10


-- заполнение таблицы Rentals (Факты_проката)
insert into Rentals
	(IdClient, IdCar, DateStart, Duration)
values
	(1,	8,	'2021/11/3',	10),		-- 1
	(7,	7,	'2021/11/12',	 2),		-- 2
	(5,	5,	'2021/11/17',	 7),		-- 3
	(1,	3,	'2021/11/1',	 4),		-- 4
	(7,	7,	'2021/11/13',	 7),		-- 5
	(3,	1,	'2021/11/1',	 8),		-- 6
	(4,	8,	'2021/11/7',	 9),		-- 7
	(7,	9,	'2021/11/2',	10),		-- 8
	(6,	2,	'2021/11/8',	 7),		-- 9
	(8,	4,	'2021/11/9',	 2),		-- 10
	(1,	1,	'2021/11/1',	 3),		-- 11
	(2,	7,	'2021/11/12',	 1),		-- 12
	(3,	2,	'2021/11/7',	 1),		-- 13
	(7,	8,	'2021/11/2',	 9),		-- 14
	(4,	5,	'2021/11/5',	 3),		-- 15
	(8,	5,	'2021/11/7',	 5),		-- 16
	(6,	9,	'2021/11/1',	 7),		-- 17
	(8,	6,	'2021/11/10',	 1),		-- 18
	(1,	3,	'2021/11/2',	10),		-- 19
	(8,	2,	'2021/11/5',	 1)			-- 20